var TestResultDesc;
(function (TestResultDesc) {
    var descObj = {
        "0": "您的词汇量约100-200，相当于零起点或小学一二年级水平，只能认识生活中少数简单的名词，无法进行交流/阅读/写作，建议背诵小学词汇。",
        "1": "您的词汇量约200-300，相当于小学三四年级水平，只能认识生活中少数简单的名词，无法进行交流/阅读/写作，建议背诵小学词汇和初中词汇。",
        "2": "您的词汇量约300-500，相当于小学五六年级水平，只能认识生活中简单的名词和部分最基本的词汇，能进行简单的听说交流，基本无阅读和写作能力，建议背诵初中词汇和高中初级词汇。",
        "3": "您的词汇量约1000—1500，相当于初三一般水平，能认识生活中的简单词汇，能进行简单的听说交流，写出简单句子，但完型填空和阅读理解稍有难度时感觉吃力，写作中缺少高级词汇，缺少亮点突破，建议背诵高中初级/中级/高级词汇。",
        "4": "您的词汇量约1800—2000，相当于高二一般水平，能认识生活中的简单词汇，能进行简单的听说交流，写出简单句子，但完型填空和阅读理解稍有难度时感觉吃力，写作中缺少高级词汇，缺少亮点突破，建议背诵高中中级/高级词汇和托福初级词汇。",
        "5": "您的词汇量约2600-3000，相当于高三较高或以上水平，能认识生活中的简单词汇，能进行简单的听说交流，写出简单句子和简单复合句，但完型阅读稍有难度时感觉吃力，写作中缺少高级词汇，缺少亮点突破，建议背诵高中以上词汇，如托福或雅思词汇。"
    };
    function resultStr(score) {
        var str1 = "词汇量检测评估结果\n";
        var str2 = "\u60A8\u8BCD\u6C47\u91CF\u68C0\u6D4B\u7684\u6210\u7EE9\u662F" + score + "\u5206\u3002\n";
        var levels = [6, 12, 24, 50, 74, 94];
        var ownerLev = 0;
        for (var i = 0; i < levels.length; i++) {
            if (score >= levels) {
                ownerLev = i;
            }
        }
        var desc = descObj[ownerLev.toString()];
        return str1 + str2 + desc;
    }
    TestResultDesc.resultStr = resultStr;
})(TestResultDesc || (TestResultDesc = {}));
//# sourceMappingURL=TestResultDesc.js.map